Tekla.Structures.ModelInternal.RebarSpacing
Defines all different types and parameters of rebar spacings associated with guidelines and their overrides.

Tekla.Structures.ModelInternal.RebarSpacing.MaxRebarSpacingZones
The maximum rebar spacing zones.

Tekla.Structures.ModelInternal.RebarSpacing.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarSpacing class.
Initializes a new RebarSpacing instance with undefined data.

Tekla.Structures.ModelInternal.RebarSpacing.CloneRebarSpacing
Clone RebarSpacing.
Returns: The Tekla.Structures.ModelInternal.RebarSpacing.

Tekla.Structures.ModelInternal.RebarSpacing.ToStruct(Tekla.Structures.ModelInternal.dotRebarSpacing_t@)
The to struct method.
dotSpacing: The dot rebar spacing struct.

Tekla.Structures.ModelInternal.RebarSpacing.FromStruct(Tekla.Structures.ModelInternal.dotRebarSpacing_t@)
The from struct method.
dotSpacing: The dot rebar spacing struct.

Tekla.Structures.ModelInternal.RebarSpacing.Zones
Gets the spacing zones.

Tekla.Structures.ModelInternal.RebarSpacing.StartOffset
Gets or sets the offset to the first bar from the start of the guideline.

Tekla.Structures.ModelInternal.RebarSpacing.EndOffset
Gets or sets the offset to the last bar from the end of the guideline.

Tekla.Structures.ModelInternal.RebarSpacing.StartOffsetIsFixed
Gets or sets a value indicating whether the start offset is fixed.

Tekla.Structures.ModelInternal.RebarSpacing.EndOffsetIsFixed
Gets or sets a value indicating whether the end offset is fixed.